#! /bin/bash

# এই ফাংশনটি স্ক্রিপ্টের মূল ফাংশন হিসাবে কাজ করে

function main () {
    # ডকুমেন্ট ডিরেক্টরি সেট করে
    doc=~/Documents
    empty=""

    # 'ফাইন্ড' কমান্ড ব্যবহার করে ফাইলের পূর্ণ পাথ খুঁজে বের করে
    : " এই লাইনটি একটি কমান্ড লাইন স্ট্রিং হিসাবে ফাইন্ড কমান্ড রান করে এবং সিস্টেমে আছে সবগুলো ফাইলের নাম যাচাই করে। এখানে / হল ফাইল সিস্টেমের রুট ডিরেক্টরি। -type f ফাইল টাইপটি নির্দেশ করে যা ফাইল টাইপের হলেও মাত্র সেগুলো নিয়েই কাজ করবে। -name $1 হল ফাইলের নাম যাচাই করতে হবে এবং $1 হল স্ক্রিপ্টের প্রথম আর্গুমেন্ট হিসাবে যে ফাইলের নাম খুঁজতে হবে সেটি যাচাই করবে। "
    result=`find / -type f -name $1`

    # যদি ফাইল পাওয়া না যায় তাহলে ঐ নামে একটি 'ডামি ফাইল' তৈরি করে
    if [ $result -eq $empty ] ; then
         # Set $result to a dummy file path in $doc directory
        result="$doc/$1"
        echo "dummy file" > "$result"
    fi

    # ফাইলের পূর্ণ পাথ আউটপুট করে
    echo $result
}

# একটি ফাইলের নাম দিয়ে ফাংশনকে কল করে

main $1